Measurement Line Offset cannot be negative.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NegativeBeltDistance { get; }
  Visual Basic
Public Shared ReadOnly Property NegativeBeltDistance As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NegativeBeltDistance {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace